# Pandas puzzles

Most the following exercises have been selected by UZH ZI & David Pinezich as part of the ZI APPD course. Inspired by [100 Numpy exerises](https://github.com/rougier/numpy-100), here is a short list of puzzles for testing your knowledge of [pandas'](http://pandas.pydata.org/) power. 

Since pandas is a large library with many different specialist features and functions, these excercises focus mainly on the fundamentals of manipulating data (indexing, grouping, aggregating), making use of the core DataFrame and Series objects. 

Many of the excerises here are stright-forward in that the solutions require no more than a few lines of code (in pandas or NumPy). Choosing the right methods and following best practices is the underlying goal.

If you're just starting out with pandas and you are looking for some other resources, the official documentation  is very extensive. In particular, some good places get a broader overview of pandas are...

- [10 minutes to pandas](http://pandas.pydata.org/pandas-docs/stable/10min.html)
- [pandas basics](http://pandas.pydata.org/pandas-docs/stable/basics.html)
- [tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html)
- [cookbook and idioms](http://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook)

Enjoy!

## Importing pandas

### Getting started and checking your pandas setup

**1.** Import pandas under the name `pd`, and numpy under its alias `np`.

In [67]:
import pandas as pd

**2.** Print the version of pandas that has been imported.

In [68]:
pd.__version__

'2.3.3'

## DataFrame basics

### A few of the fundamental routines for selecting, sorting, adding and aggregating data in DataFrames

**3.** Load the data from `pd_puzzles.csv`. Assign the following list as indices: `['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']`.

In [69]:
df_puzzle = pd.read_csv("pd_puzzles.csv")
df_puzzle.index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df_puzzle

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

**4.** Display the basic information about this DataFrame and its data.

In [70]:
df_puzzle.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

**5.** Display the summary statistics about the data in the df.

In [71]:
df_puzzle.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

**6.** Select just the 'animal' and 'age' columns from the DataFrame `df`.

In [72]:
df_puzzle[["animal", "age"]]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

**7.** Select the data in rows `[3, 4, 8]` *and* in columns `['animal', 'age']`.
(**hint**: df.index)

In [73]:
df_puzzle.iloc[[3,4,8]][["animal", "age"]]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

**8.** Select only the rows where the number of visits is greater than 2.

In [74]:
df_puzzle[df_puzzle["visits"]>2]

  animal  age  visits priority
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no

**9.** Select the rows where the age is missing, i.e. is `NaN`.
(**hint**: isna)

In [75]:
df_puzzle[df_puzzle["age"].isna()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

**10.** Select the rows where the animal is a cat *and* the age is less than 3.

In [76]:
df_puzzle[(df_puzzle["animal"] == "cat") & (df_puzzle["age"] < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

**11.** Change the age of the cat in row 'd' to 5.5. (**hint**: You can use both implicit or explicit indices)

In [77]:
df_puzzle.loc["d","age"] = 5.5

df_puzzle

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  5.5       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

**12.** Calculate the sum of all visits (the total number of visits).

In [78]:
df_puzzle["visits"].sum()

np.int64(19)

**13.** Calculate the mean age for each different animal in `df`.

In [79]:
df_mean_age = df_puzzle.groupby("animal",as_index=False)["age"].mean()
df_mean_age

  animal    age
0    cat  2.500
1    dog  5.125
2  snake  2.500

**14.** Append a new column 'newcol' to `df` with your choice of values for each column. Then delete that column to return the original DataFrame.

In [80]:
df_puzzle["newcol"] = [1,2,3,4,5,6,7,8,9,10] #adding new column
df_puzzle

  animal  age  visits priority  newcol
a    cat  2.5       1      yes       1
b    cat  3.0       3      yes       2
c  snake  0.5       2       no       3
d    dog  5.5       3      yes       4
e    dog  5.0       2       no       5
f    cat  2.0       3       no       6
g  snake  4.5       1       no       7
h    cat  NaN       1      yes       8
i    dog  7.0       2       no       9
j    dog  3.0       1       no      10

In [81]:
df_puzzle.drop(["newcol"], axis=1, inplace=True) #with inplace=True it changes df directly, if false I would need to assign it to a new df, axis=1 for accessing columns 0 would be for rows
df_puzzle

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  5.5       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

**15.** Append a new row to `df` for a 5 y.o. parrot on his second visit with no priority. Then delete that row again to return to the original DataFrame.

In [82]:
df_puzzle._append({"animal":"parrot", "age": 5, "visits": 2, "priority": "no"}, ignore_index=True)

    animal  age  visits priority
0      cat  2.5       1      yes
1      cat  3.0       3      yes
2    snake  0.5       2       no
3      dog  5.5       3      yes
4      dog  5.0       2       no
5      cat  2.0       3       no
6    snake  4.5       1       no
7      cat  NaN       1      yes
8      dog  7.0       2       no
9      dog  3.0       1       no
10  parrot  5.0       2       no

In [83]:
df_puzzle.drop(df_puzzle[df_puzzle["animal"] == "parrot"].index, inplace=True)
df_puzzle

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  5.5       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

**16.** The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be `True` and 'no' should be `False`.

In [85]:
for i,j in df_puzzle["priority"].items(): # items lets you iterate over pairs (i,j)
    if j == "yes":
        df_puzzle.loc[i, "priority"] = True
    if j == "no":
        df_puzzle.loc[i, "priority"] = False

df_puzzle

  animal  age  visits priority
a    cat  2.5       1     True
b    cat  3.0       3     True
c  snake  0.5       2    False
d    dog  5.5       3     True
e    dog  5.0       2    False
f    cat  2.0       3    False
g  snake  4.5       1    False
h    cat  NaN       1     True
i    dog  7.0       2    False
j    dog  3.0       1    False

**17.** In the 'animal' column, change the 'snake' entries to 'python'.

In [89]:
df_puzzle.loc[df_puzzle["animal"] == "snake", "animal"] = "python"
df_puzzle

   animal  age  visits priority
a     cat  2.5       1     True
b     cat  3.0       3     True
c  python  0.5       2    False
d     dog  5.5       3     True
e     dog  5.0       2    False
f     cat  2.0       3    False
g  python  4.5       1    False
h     cat  NaN       1     True
i     dog  7.0       2    False
j     dog  3.0       1    False

**18.** Sort `df` first by the values in the 'age' in *decending* order, then by the value in the 'visit' column in *ascending* order.

In [90]:
df_puzzle.sort_values(by="age", ascending=False)

   animal  age  visits priority
i     dog  7.0       2    False
d     dog  5.5       3     True
e     dog  5.0       2    False
g  python  4.5       1    False
j     dog  3.0       1    False
b     cat  3.0       3     True
a     cat  2.5       1     True
f     cat  2.0       3    False
c  python  0.5       2    False
h     cat  NaN       1     True

In [98]:
df_puzzle.sort_values(by="visits", ascending=True)

   animal  age  visits priority
a     cat  2.5       1     True
h     cat  NaN       1     True
g  python  4.5       1    False
j     dog  3.0       1    False
e     dog  5.0       2    False
c  python  0.5       2    False
i     dog  7.0       2    False
b     cat  3.0       3     True
f     cat  2.0       3    False
d     dog  5.5       3     True

**19.** Create a copy of the animal column, delete all duplicated rows and add another column with the biological family (dogs = canidae, cats = felidae, python = pythonidea), then merge the copy with the original dataframe.

In [100]:
df_animal = df_puzzle[["animal"]]

df_animal

   animal
a     cat
b     cat
c  python
d     dog
e     dog
f     cat
g  python
h     cat
i     dog
j     dog

In [103]:
df_animal = df_animal.drop_duplicates()
df_animal

   animal
a     cat
c  python
d     dog

In [108]:
df_animal["biological_family"] = df_animal["animal"].map({"dog" : "canidae", "cat": "felidae", "python": "pythonidea"})
df_animal

   animal biological_family
a     cat           felidae
c  python        pythonidea
d     dog           canidae

In [109]:
df_puzzle.merge(df_animal, how='outer')

   animal  age  visits priority biological_family
0     cat  2.5       1     True           felidae
1     cat  3.0       3     True           felidae
2     cat  2.0       3    False           felidae
3     cat  NaN       1     True           felidae
4     dog  5.5       3     True           canidae
5     dog  5.0       2    False           canidae
6     dog  7.0       2    False           canidae
7     dog  3.0       1    False           canidae
8  python  0.5       2    False        pythonidea
9  python  4.5       1    False        pythonidea

**20.** For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

In [110]:
df_puzzle.pivot_table(index="animal", columns="visits", values="age", aggfunc="mean")

visits    1    2    3
animal
cat     2.5  NaN  2.5
dog     3.0  6.0  5.5
python  4.5  0.5  NaN

**21.** Given a DataFrame of numeric values, say
```python
df2 = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values
```

how do you subtract the row mean from each element in the row?

In [124]:
import numpy as np
df2 = pd.DataFrame(np.random.random(size=(5, 3)))

df22 = df2.sub(df2.mean(axis=1), axis=0)

df22

          0         1         2
0  0.166674  0.111953 -0.278627
1 -0.429282  0.089519  0.339763
2  0.013967  0.287763 -0.301730
3 -0.239266  0.180734  0.058532
4 -0.616353  0.260471  0.355882

**22.** Suppose you have DataFrame with 10 columns of real numbers, for example:

```python
df2 = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
```
Which column of numbers has the smallest sum? (Find that column's label.)

In [132]:
df2 = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df2

df2.sum(axis=0).idxmin()

'f'

In [130]:
df2

,a,b,c,d,e,f,g,h,i,j
0,0.922771,0.298415,0.324003,0.075370,0.820778,0.024708,0.915961,0.974497,0.523494,0.484714
1,0.940998,0.217319,0.296782,0.319793,0.264230,0.429513,0.864001,0.846447,0.161212,0.708781
2,0.826892,0.223977,0.779829,0.606840,0.061335,0.914448,0.877390,0.951447,0.765026,0.940369
3,0.633447,0.012206,0.475818,0.255360,0.945122,0.456323,0.438467,0.863038,0.766920,0.903784
4,0.800884,0.250420,0.474629,0.087164,0.910916,0.128795,0.898206,0.567318,0.569700,0.623403

**23.** How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)? What about unique entries in each columns?

Use the follwing dataframe:
```python
df_3 = pd.DataFrame({
    "A": [1, 1, 2, 2, 3, 3, 3],
    "B": [10, 10, 20, 20, 30, 31, 30],
    "C": ["x", "x", "y", "y", "z", "z", "z"]
})
```

In [ ]:
df_3 = pd.DataFrame({
    "A": [1, 1, 2, 2, 3, 3, 3],
    "B": [10, 10, 20, 20, 30, 31, 30],
    "C": ["x", "x", "y", "y", "z", "z", "z"]
})

df_3

   A   B  C
0  1  10  x
1  1  10  x
2  2  20  y
3  2  20  y
4  3  30  z
5  3  31  z
6  3  30  z

In [137]:
df_unique_rows = len(df_3.drop_duplicates())
df_unique_rows

4

In [139]:
df_3.nunique()

A    3
B    4
C    3
dtype: int64